ЕСКД/src/InformationRegisters/mega_ЦеныПоставщиков/mega_ЦеныПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>mega_ЦеныПоставщиков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.mega_Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.mega_Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЕСКД/src/InformationRegisters/mega_ЦеныПоставщиков/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗафиксироватьЦены(ВыборкаДетальныеЗаписи) Экспорт
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;	
КонецПроцедуры

// Возвращает выборку (Поставщик, Номенклатура, Цена)
// 
// Параметры:
//  Поставщики - Массив Из СправочникСсылка.mega_Контрагенты - Массив контрагентов (поставщиков)
//  Номенклатура - Массив Из СправочникСсылка.mega_Номенклатура - Массив номенклатуры
//  ДатаСреза - Дата
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса
Функция ПолучитьЦеныПоставщиков(Поставщики, Номенклатура, ДатаСреза = Неопределено) Экспорт
	
	Если ДатаСреза = Неопределено Тогда
		
		ДатаСреза = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныПоставщиков.Поставщик,
		|	ЦеныПоставщиков.Номенклатура,
		|	ЦеныПоставщиков.Цена
		|ИЗ
		|	РегистрСведений.mega_ЦеныПоставщиков.СрезПоследних(&ДатаСреза, Поставщик В (&Поставщики)
		|	И Номенклатура В (&Номенклатура)) КАК ЦеныПоставщиков";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Поставщики", Поставщики);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;	
КонецФункции

// Возвращает выборку (Поставщик, Номенклатура, Цена)
// 
// Параметры:
//  Поставщик - СправочникСсылка.mega_Контрагенты - Контрагент (поставщик)
//  Номенклатура - СправочникСсылка.mega_Номенклатура - Номенклатура
//  ДатаСреза - Дата
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса
Функция ПолучитьЦенуНоменклатурыПоставщика(Поставщик, Номенклатура, ДатаСреза = Неопределено) Экспорт
	
	МассивПоставщики = Новый Массив;МассивПоставщики.Добавить(Поставщик);
	МассивНоменклатура = Новый Массив;МассивНоменклатура.Добавить(Номенклатура);	
	Возврат ПолучитьЦеныПоставщиков(МассивПоставщики, МассивНоменклатура, ДатаСреза);
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
